<template>
  <div class="protocolW">
    <div class="headerW">
      <div class="header">
        <span class="back" @click="goBack"></span>
        <p>隐私政策</p>
      </div>
    </div>
    <div class="protocol-main">
      <div class="title">一、隐私保护</div>
      <div class="protocol-content">1.1 椰子竞技积分平台（以下简称为“本平台”）的所有权和运营权归海南自贸区椰云网络科技有限公司（以下简称为“我司”）所有。</div>
      <div class="protocol-content">1.2在您访问或使用本平台提供的信息或服务时，我司会获取您的用户信息。在此我司承诺会正确使用您的用户信息，并承诺会采取相应的技术和管理手段保护您的用户信息。</div>
      <div class="protocol-content">
        <p>1.3 本平台获取用户信息主要目的是为您提供一个顺畅、高效的服务流程，并致力于不断完善和提升您的服务体验。本平台所收集的资料,包括如下内容：</p>
        <p>（1）个人基本信息，（包括个人姓名、年龄、生日、性别、住址、个人电话号码、电子邮箱）；</p>
        <p>（2）个人身份背景信息：包括但不限于 身份证、职业、教育程度等；</p>
        <p>（3）网络身份标识信息（包括个人信息主体账号、IP地址、个人数字证书等）；</p>
        <p>（4）个人财产信息（包括交易和消费记录、余额、游戏类兑换码等虚拟财产信息）；</p>
        <p>（5）其他信息，如个人上网记录（包括网页浏览记录、软件使用记录、点击记录）等；</p>
      </div>
      <div class="protocol-content">
        <p>1.4 我司可能将用户所提供的个人资料用于以下一项或多项目的：</p>
        <p>（1） 满足用户使用本平台的网上服务及其它服务的要求。</p>
        <p>（2）更好的用户服务和用户沟通，包括但不限于积分积累、提供有关优惠及服务、项目研究及计划发展等；</p>
        <p>（3）更好的优惠享受，如为用户送上有关本平台通的最新推荐和促销优惠；</p>
        <p>（4）应用户的垂询而与用户联络，与您就您的问题、投诉等事宜进行沟通交流，处理您的投诉与建议；</p>
        <p>（5）更准确的身份确认，管理您的账户，便于您登录本网站；</p>
        <p>（6）其他为更好的实现和优化本平台的服务的目的。</p>
      </div>
      <div class="protocol-content">
        <p>1.5 信息共享</p>
        <p>用户信息是我司业务的重要组成部分，我司不会因为利益将其转卖或无故与其他人共享或向其他人披露您的个人信息，但是以下情形除外：</p>
        <p>（1）合作伙伴：我司可能会与我司的关联公司、入驻商家或合作伙伴共享用户信息；某些服务需由合作伙伴（包括但不限于合作伙伴、提供相关技术服务的公司、运输公司、邮寄公司、提供奖品的公司等）提供或共同提供，为了向用户提供此类服务，本平台有必要与提供该服务的合作伙伴共享完成该服务所需要的用户个人信息。</p>
        <p>（2）第三方服务提供者：我司有可能聘请其它公司或个人代表我司提供某些产品或服务。此种情况下，您同意您提供给我司及其关联方的信息，及您享受本平台服务产生的信息（包括本协议签署之前提供和产生的），可用于我司及其关联方及因服务必要而委托的第三方为用户提供服务及推荐产品，法律禁止的除外。本平台及其委托的第三方对上述信息负有保密义务。本条款自本协议签署时生效，具有独立法律效力，不受合同成立与否及效力状态变化的影响。</p>
        <p>（3）本平台会与第三方共同进行推广活动，在推广活动中所收集的全部或部分个人信息可能会与该第三方分享。</p>
      </div>
      <div class="protocol-content">
        <p>1.6 未经用户授权，本平台不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储在本平台的非公开内容，但下列情况除外：</p>
        <p>（1）事先获得用户的明确授权；</p>
        <p>（2）根据有关的法律法规要求；</p>
        <p>（3）按照相关政府主管部门的要求；</p>
        <p>（4）为防止用户本人、他人的合法权益以及社会公众的利益受到损害。</p>
        <p>（5）由于用户对自身信息保密不当，从而导致用户资料的泄露。</p>
        <p>（6）由于网络线路、黑客攻击、计算机病毒等原因造成的资料泄露、丢失、被盗用或被篡改等。</p>
      </div>
      <div class="title">二、网络服务内容的所有权</div>
      <div class="protocol-content">本平台定义的网络服务内容包括：文字、软件、声音、图片、录像、图表、广告中的全部内容；电子邮件的全部内容；本平台为用户提供的其它信息。所有这些内容受版权、商标、标签和其它财产所有权法律的保护。因此，用户只能在本平台和广告商授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。本平台所有的文章版权归原文作者和本平台共同所有，任何人需要转载本平台的文章，必须征得原文作者和本平台授权。</div>
      <div class="title">三、责任免除及限制</div>
      <div class="protocol-content">3.1 请用户妥善保管用户名和密码，若帐户被盗，则由此引起的任何积分或经济等损失由用户个人负责。</div>
      <div class="protocol-content">3.2 本平台将尽力确保合作伙伴能提供有关产品和服务，但对因合作伙伴未能提供有关产品和服务而引起的损失不承担责任。当用户使用合作伙伴的产品和服务时，须受合作伙伴的条款及细则约束，本平台不会负责任何损失。</div>
      <div class="protocol-content">
        <p>3.3 本平台在符合下列条件之一时，可对用户个人资料进行必要的使用，并被免于任何责任：</p>
        <p>（1）本协议第1.6条所约定之情形；</p>
        <p>（2）由于本平台不拥有或不控制的公司以及本平台不雇佣或不管理的人员所造成的个人信息的泄露及由此而导致的任何法律争议和后果；</p>
        <p>（3）由于与本平台用户网站链接的其它网站所造成之个人资料泄露及由此而导致的任何法律争议和后果。</p>
      </div>
      <div class="protocol-content">3.4 本平台可能包括指向第三方网站（下称“第三方网站”）。“第三方网站”非由本平台所控制，对于任何“第三方网站的内容，包括但不限于“第三方网站”内含的任何链接，或“第三方网站”的任何改变或更新，本平台均不予负责。自“第三方网站”接收的网络传播或其它形式之传送，本平台也不予负责。本平台在域名上提供这些链接仅为了您的便利所设，加入任何链接不表示本平台与这些网站经营者有任何关连。您有责任查阅并遵守“第三方网站”上登载的隐私声明及使用规定。</div>
      <div class="protocol-content">3.5 本平台无法保证网络服务一定能满足用户的要求，也不保证网络服务的及时性、安全性、准确性。如因不可抗力或其它本平台无法控制的原因使本平台系统崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，本平台不承担任何责任，但本平台会尽可能合理地协助处理善后事宜，并尽最大努力使客户免受损失。</div>
      <div class="protocol-content">3.6 用户同意，由于用户违反本协议，或违反通过援引并入本协议并成为本协议一部分的文件，或由于用户使用本平台服务违反了任何法律或第三方的权利而造成任何第三方进行或发起的任何补偿申请或要求（包括律师费用），用户会对本平台及其关联方、合作伙伴、董事以及雇员给予全额补偿并使之不受损害。</div>
      <div class="protocol-content">3.7 在法律允许的情况下，本平台对于与本协议有关或由本协议引起的，或者，由于使用本平台、或由于其所包含的或以其它方式通过本平台提供给个人会员的全部信息、内容、材料、产品（包括软件）和服务、或购买和使用产品引起的任何间接的、惩罚性的、特殊的、派生的损失（包括但不限于业务损失、收益损失、利润损失、使用数据或其他经济利益的损失），不论是如何产生的，也不论是由对本协议的违约（包括违反保证）还是由侵权造成的，均不负有任何责任，即使其事先已被告知此等损失的可能性。另外即使本协议规定的排他性救济没有达到其基本目的，也应排除本平台对上述损失的责任。</div>
      <div class="title">四、本政策如何更新</div>
      <div class="protocol-content">本隐私政策内容会不时根据个人信息保护政策及法律法规的修订进行更新。任何关于隐私政策内容的对您权益有重大影响的重要变更将会通过在本平台发布通知的方式和/或我司不时采用的其他方式告知您。隐私政策更新后我司亦会标注该更新的日期。变更后的隐私政策一经在本平台公布后，立即自动生效。如用户不同意相关变更，应当立即停止使用本平台服务。如用户继续使用本平台服务的，即表示用户接受经修订的隐私政策。</div>
      <div class="title">五、如何联系我们</div>
      <div class="protocol-content">若您对本隐私政策内容有任何疑问、意见或建议，或您希望更新、改变您的授权，敬请致电联系我司。</div>
    </div>
  </div>
</template>
<script>
export default {
  methods: {
    goBack() {
      this.$router.back()
    }
  }
}
</script>
<style lang="scss" scoped>
@import '~@/scss/color.scss';
.protocolW {
  position: relative;
  background: #ffffff;
  // height: 100%;
  .headerW {
    position: static;
    padding: 0.2rem 0.32rem;
    width: 100%;
    box-sizing: border-box;
    background: #ffffff;
    .header {
      position: relative;
      .back {
        position: absolute;
        width: 0.48rem;
        height: 0.48rem;
        background: url(/static/images/logo/btn_back.png);
        background-size: 100% 100%;
      }
      P {
        text-align: center;
        font-size: 0.36rem;
        font-weight: bold;
        color: #2C2C2C;
      }
    }

  }
  .protocol-main  {
    padding: 0.1rem 0.52rem 0.78rem;
    color: #2C2C2C;
    .title {
      margin-top: 0.8rem;
      font-size: 0.32rem;
      font-weight: bold;
      &:first-child {
        margin-top: 0;
      }
    }
    .protocol-content {
      margin-top: 0.4rem;
      font-size: 0.28rem;
      line-height: 0.4rem;
    }
  }
}
</style>
