<template>
  <div class="protocolW">
    <div class="headerW">
      <div class="header">
        <span class="back" @click="goBack"></span>
        <p>用户服务协议</p>
      </div>
    </div>
    <div class="protocol-main">
      <div class="title">一、总则</div>
      <div class="protocol-content">1.1 椰子竞技积分平台（以下简称为“本平台”）的所有权和运营权归海南自贸区椰云网络科技有限公司（以下简称为“我司”）所有。</div>
      <div class="protocol-content">1.2 用户在注册之前，应当仔细阅读本协议。一旦注册成功，则用户与椰子竞技积分平台之间自动形成协议关系，视为用户自愿遵守本协议的约束。</div>
      <div class="protocol-content">1.3 根据国家法律法规变化及网站运营需要，本平台有权对本协议条款不时地进行修改，一旦本协议的内容发生变动，本平台将通过平台公布最新的服务协议，不再向用户作个别通知。修改后的协议自被公布在本平台之日起生效，并代替原来的协议。用户可随时登录查阅最新协议；用户有义务不时关注并阅读最新版的协议及网站公告。如用户不同意更新后的协议应立即停止接受本平台依据本协议提供的服务；如用户继续使用本网站提供的服务的，即视为同意更新后的协议，并应遵照修改后的协议执行。具体的合作第三方信息和积分规则可登录本平台查询，以平台更新为准。</div>
      <div class="protocol-content">1.4 本平台在此特别提醒您认真阅读、充分理解本协议各条款，特别是其中所涉及的免除或限制本平台责任的条款、排除或限制用户权利的条款等。请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权使用本平台于本协议下所提供的服务。您一经注册或使用本平台服务即视为对本协议全部条款已充分理解并完全接受。</div>
      <div class="protocol-content">1.5平台上的全部内容的版权均属于我司所有，该内容包括但不限于文本、数据、文章、设计、源代码、软件、图片、照片及其他全部信息(以下称“平台内容”)。平台内容受中国著作权法及各国际版权公约的保护。未经平台事先书面同意，用户承诺不以任何方式、不以任何形式复制、模仿、传播、出版、公布、展示网站内容，包括但不限于电子的、机械的、复印的、录音录像的方式和形式等。用户承认平台内容是属于平台的财产，未经平台书面同意，用户不得将平台内容镜像到任何其他网站或者服务器。任何未经授权对平台内容的使用均属于违法行为，平台将追究用户的法律责任。</div>
      <div class="title">二、服务内容</div>
      <div class="protocol-content">2.1 椰子竞技积分平台服务是通过椰子竞技积分平台及客户端等各种方式向用户提供的服务，具体服务内容以本平台当时提供的服务内容为准。</div>
      <div class="protocol-content">2.2 除本平台提供的服务之外的其他与网络服务有关的设备（如个人电脑、手机、及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费）均应由用户自行负担。</div>
      <div class="protocol-content">2.3 本平台对于用户的通知及任何其他的协议、告示或其他关于用户使用会员账户及服务的通知，用户同意本平台可通过本平台公告、站内信、电子邮件、手机短信、无线通讯装置等电子方式或邮寄等物理方式进行，该等通知于发送之日视为已送达收件人（如以邮寄方式向用户发出通知的，则在该等通知按照用户在本平台留存的联系地址交邮后的第三个自然日即视为送达）。因不可归责于本平台的原因（包括但不限于电子邮件地址、手机号码、联系地址等不准确或无效、信息传输故障等）导致用户未在前述通知视为送达之日收到该等通知的，本平台不承担任何责任。</div>
      <div class="title">三、用户的权限及义务</div>
      <div class="protocol-content">3.1 经本平台注册系统完成注册程序并通过身份认证的用户即成为正式用户，可以获得本平台规定用户所应享有的权限；未经认证仅仅完成注册的用户享有本平台规定的部分用户权限。本平台有权对用户的权限设计进行变更。</div>
      <div class="protocol-content">
        <p>3.2 用户应承诺以下事项：</p>
        <p>（1） 用户必须提供真实、最新、有效及完整的资料。</p>
        <p>（2） 保证并承诺通过本平台进行交易的资金来源合法。</p>
        <p>（3） 有义务维持并更新用户的资料，确保其为真实、最新、有效及完整。若用户提供任何错误、虚假、过时或不完整的资料，或者本平台依其独立判断怀疑资料为错误、虚假、过时或不完整，本平台有权行使包括但不限于停用用户帐户、拒绝用户使用本平台服务的部份或全部功能的权力。在此情况下，本平台不承担任何责任，并且用户同意负担因此所产生的直接或间接的任何支出或损失。</p>
      </div>
      <div class="protocol-content">3.3 如因用户未及时更新基本资料，导致本平台与用户间通信遗失、延误或过期或本平台服务无法提供或提供时发生任何错误，用户不得将此作为取消交易或拒绝付款的理由，本平台亦不承担任何责任，所有后果应由用户承担。</div>
      <div class="protocol-content">3.4 除本协议以外，用户应同时遵守本平台不时发布及更新的全部规则，包括但不限于公告、产品流程说明、平台项目说明、风险提示等。</div>
      <div class="protocol-content">3.5 用户不得损害本平台、其它用户或其他任何第三方的合法权益。</div>
      <div class="protocol-content">3.6 不得在平台上发布任何违反国家有关法律法规的信息。</div>
      <div class="protocol-content">3.7 不得以恶意方式（包括但不限于重复注册多个帐号）获得积分。</div>
      <div class="protocol-content">3.8 不得滥用椰子竞技积分平台积分，包括但不限于擅自出售或交易积分，呈报不实之资料（如消费记录）、注册多个帐户明显作弊的、多个帐户之间恶意合并积分、洗钱、赌博、非法融资及其他我司认为不得使用本平台服务进行的行为。</div>
      <div class="protocol-content">3.9 不得以获取非法利益为目的，使用人工手段或者系统软件工具批量注册平台账户。</div>
      <div class="protocol-content">3.10 在获取和使用积分过程中，必须遵守椰子竞技积分平台积分获取和使用业务规则，为了保护正常用户权益，本平台有权制定积分获取和使用的风险控制规则，并对于触发风险控制规则的积分获取和交易以及相关账户进行管制。</div>
      <div class="protocol-content">3.11 若用户存在或本平台有合理理由怀疑用户存在第3.5-3.9条中的违法、违约及不合理使用本服务的行为，本平台无须经过用户同意或提前通知用户，将单独判断，视情节不同，有权采取如下措施且不承担任何责任：冻结用户账户及其关联账户、暂停或终止提供服务、取消已积累积分、要求赔偿损失、要求用户按实际售价缴付已兑换奖品费用及相应的运费等。若触及法律，本平台保留追究法律责任的权利，用户须承担相关的律师费、诉讼费等。若涉嫌从事以上违法或违约行为的怀疑被解除，用户需要恢复账户和服务功能，需根据本平台的要求提供相应身份证明等信息。</div>
      <div class="protocol-content">3.12因监管部门的需要，本平台有义务配合国家相关行政机关对用户账号进行检查及处理。</div>
      <div class="title">四、涉及第三方网站</div>
      <div class="protocol-content">平台的手机客户端、网站内容可能涉及由第三方所有、控制或者运营的其他网站或手机客户端（以下称“第三方网站”）。平台不能保证也没有义务保证第三方网站上的信息的真实性和有效性。用户确认按照第三方网站的服务协议使用第三方网站，而不是按照本协议。第三方网站的内容、产品、广告和其他任何信息均由用户自行判断并承担风险，而与平台无关。</div>
      <div class="title">五、附则</div>
      <div class="protocol-content">5.1 本协议签订地为中国海南自贸区。本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。所有用户（包括但不限于大陆及港澳台地区用户员），如就本协议产生争议及纠纷，应尽量友好协商解决；</div>
      <div class="protocol-content">5.2 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</div>
      <div class="protocol-content">5.3 用户如有任何问题，可随时拨打客服热线0898-3130-5180。</div>
      <div class="protocol-content">5.4 本协议解释权及修订权归我司所有。</div>
    </div>
  </div>
</template>
<script>
export default {
  methods: {
    goBack() {
      this.$router.back()
    }
  }
}
</script>
<style lang="scss" scoped>
@import '~@/scss/color.scss';
.protocolW {
  position: relative;
  background: #ffffff;
  .headerW {
    position: static;
    padding: 0.2rem 0.32rem;
    width: 100%;
    box-sizing: border-box;
    background: #ffffff;
    .header {
      position: relative;
      .back {
        position: absolute;
        width: 0.48rem;
        height: 0.48rem;
        background: url(/static/images/logo/btn_back.png);
        background-size: 100% 100%;
      }
      P {
        text-align: center;
        font-size: 0.36rem;
        font-weight: bold;
        color: #2C2C2C;
      }
    }

  }
  .protocol-main {
    padding: 0.1rem 0.52rem 0.78rem;
    color: #2C2C2C;
    .title {
      margin-top: 0.8rem;
      font-size: 0.32rem;
      font-weight: bold;
      &:first-child {
        margin-top: 0;
      }
    }
    .protocol-content {
      margin-top: 0.4rem;
      font-size: 0.28rem;
      line-height: 0.4rem;
    }
  }
}
</style>
